
//Credits: https://steamcommunity.com/sharedfiles/filedetails/?id=2829701779

//Names

const ENEMY_NAMES_GENERIC_SCH =  [
	"多尼", "史蒂夫", "索伦", "洛基", "布鲁斯", "尼克", "柯林特", "山姆", "罗迪", "斯科特", "约翰", "彼得", "尤昂", "阿拉基",
	"汉克", "扎拉", "埃裡奇", "格斯", "刘易斯", "吉米", "费尔", "凯恩", "马萨努", "普约希科", "亚伦", "艾伯特",  "卡莱达",
	"丹尼尔", "布莱恩", "卡尔", "查理斯", "艾维斯", "弗瑞德", "杰弗瑞", "加文", "弗兰克思", "亨利", "以撒", "雅各", "乔", "贾斯汀",
	"肯尼斯", "利安得尔", "雷欧", "劳瑞恩", "兰德尔", "奥利弗", "奥斯卡", "麦克", "马克", "劳伦", "斯考特", "汤米", "汤姆",
	"文森特", "汤姆", "托马斯", "弗农", "罗宾逊", "罗杰", "罗伊", "理奇", "杰弗里", "格林顿", "基诺", "哈迪", "哈利", "艾达",
	"雷克斯", "兰迪", "马修", "马丁", "迈克尔", "尼古拉斯", "基诺", "福特", "艾德蒙", "雨果", "霍德华", "雅各布",
	"杰瑞", "杰罗姆", "凯文", "马尔科姆", "特朗普", "詹姆士", "詹森", "以利亚", "爱德华", "杰弗瑞", "乔纳森", "兰斯", "劳伦特", "肯尼",
	"约书亚", "马库斯", "劳瑞恩", "卢克", "玛律斯", "埃德加", "迪伦", "路易斯", "莱斯利", "马西", "马尔斯", "尼尔森", "伊凡",
	"多尔", "塞缪尔", "阿巴斯", "艾伯特", "艾布尔", "科迪", "大卫", "道格拉斯", "保罗", "菲利普", "拉德尔", "伦道夫", "洛克", "亚伯拉罕",
	"艾贝尔", "比尔", "贾森", "艾文", "安德鲁", "本森", "柯立夫", "克拉克", "塞西", "本杰明", "肖恩", "斯坦利", "威廉",
	"埃尔文", "艾金", "卡洛斯", "赫尔曼", "埃里克", "呼呼", "德里克", "莱安", "鲍勃", "布兰特", "布伦特", "威利", "卫斯理", "邦尼", "艾肯",
	"斯帕克", "西德尼", "斯宾塞", "斯图亚特", "提姆", "托德", "泰勒", "华纳", "尤利塞斯", "维恩", "维克多", "艾登", "达利安", "达瑞斯",
	"佈伦南", "特洛耶", "利克", "利亚姆", "哈里斯", "克里斯丁", "莱特", "扎特", "坎贝尔", "太郎", "次郎", "三郎",


	"佩普斯", "维克特", "暴风雨", "大力神", "策勒", //March Patreons
	"菲里克", "布雷泽", "莱尼", "博洋", "克劳兹", "瓦伊", "马克斯", //March Discord Bonus
	"菲里克", "黑田", "利姆露", "厄普萨伯", //March Twitter Bonus
	"洛特哥特", "爱德华 迪米", "马克·格里迪", "丹·斯达迪", "鲍勃 拉克金", "梅佛", "克里斯·皮寇特", //July Patreons
	"狼怒", "戴米安得", "德芙", "德米特里", "亚里克", "泽维尔", "蕾", "斯垂德", "恶魔", "扎顿", "该隐", "克里斯多夫" //July Patreons
];

const ENEMY_NAMES_GENERIC_TCH =  [
	"トニー", "スティーブ", "ソー", "ロキ", "ブルース", "ニック", "クリント", "サム", "ローディ", "スコット", "ヨハン", "ピーター", "ウォン", "アキラ",
	"ハンク", "チャラ", "エリック", "グース", "ルイス", "ジミー", "フィル", "エリック", "カーン", "マサル", "ピヨヒコ", "ヨシヒコ", "メレブ",  "カネダ", 
	"ジョン", "バリー", "ハル", "クラーク", "カル", "オリバー", "カーター", "ラルフ", "ブンケン", "ロニー", "ウォーリー", "ディック", "ナナシ", "テツオ", 
	"ビクター", "アーサー", "サイモン", "バート", "フロイド", "タツ", "ジャック", "ネッガー", "フルフル", "タックン", "カンチ", "ユキヒロ", "モトキ",  
	"トビン", "ヒース", "グレゴリー", "ジェフリー", "サイモン", "ドワイト", "セディク", "トクッチ", "ヒロキ", "サトウ", "ホッパ", "チャン", "ピーター", 
	"レン", "ジョージ", "ダレク", "ベン", "ダン", "アドル", "クリスティン", "ドギ", "ダルク", "ファクト", "ルタ", "ジェンマ", "チェスター", "ゴードン", 
	"トーマス", "ブルック", "ヨジ", "カーメン", "ガバチョ", "ヴァルガス", "ポン", "タケ", "ヤマ", "ニキ", "タマオ", "ガリクソン", "ヒデ", "アリ", "デンシャ",
	"コビー", "キシャ", "ポッポ", "ホーク", "モゲタ", "カツオ", "ナミヘー", "タマ", "ヨネスケ", "シンノス", "ヒロシ", "ノハラ", "ドルマン", "タイサ", "ビッグズ", 
	"ゼイン", "リアム", "ナイル", "ホーラン", "ソリマチ", "ザクトン", "ナスィン", "ブリンク", "ワン", "エイト", "トゥー", "ソニー", "ノラ", "チンミ",
	"パープス", "リムル", "ジオ", "セシール", "セガール", "アンソニー", "パイディ", "モミマン", "パーン", "ロードス", "オッチョ", "セーキ", "アリ", "バーグ",
	"ココシ", "カカシ", "ナルティ", "バギ", "ゴメス", "ボリバン", "アール", "ベギモン", "カーチュギ", "ユインプ", "イギシ", "カメン", "ナナシ", "マーク",
	"カーンベ", "コリニュ", "オボエテ", "ワスレテ", "アナッギ", "ケン", "ネック", "ジョウ", "カーネギー", "アンドリュー", "デール", "ジョン", "ベゾス", "ジェフ", 

	"傭兵ノＴ" //2021 December Ci-ens
];

const ENEMY_NAMES_THUG_SCH =  [
	"红影犬", "肥尸", "汤米", "衰狗", "大吾", "恐龙", "大头仔", "大话精", "强尼", "大波莲", "战车", "迪克",
	"罗汉果", "花旗参", "毒鼠", "大生地", "犀牛皮", "乔乔", "鹧鸪菜", "白兰度", "大嘴英", "大货", "岩渣", "大天二", "骨精强",
	"火牛", "松鸦", "保险丝", "森利茨", "肥龙", "蓝调", "病毒", "罗密欧", "加菲", "暴龙", "泥锅", "人字拖", "大麻成", "大口九",
	"克蛇龟", "威震天", "西索", "武藏", "小次郎", "小刚", "真嗣", "根斗", "霸天虎", "烂命伦", "王子", "英雄", "老虎",
	"摩根", "尤金", "大头鱼", "一郎", "傻标", "基哥", "大傻", "哔哥", "大咪", "乌鸦", "靓坤", "山鸡", "巢皮", "奔雷虎",

	"马克斯", "卡威卡", "哈萨尔", "毕格斯", "艾登", "魏吉", "安坉", "阿德里尔·迪亚兹", "米普斯塔·伯恩" //April Patreons
];

const ENEMY_NAMES_THUG_TCH =  [
	"ランブル", "クレイン", "トミィ", "ジュアン", "ダイゴ", "ジョンソン", "キャリマン", "ラリー", "ジョニー", "ナリド", "タンク", "ディック", "ウェッジ", 
	"ジョーイ", "ホアス", "マウス", "ヴァニラ", "アイス", "ジョジョ", "ディオ", "ブランドー", "スピード", "ワゴン", "ウェスト", "サウス", "ノース", 
	"クール", "ジェイ", "シンカン", "ゼンリツ", "セン", "ブルース", "ウィルス", "ロミオ", "カフィ", "パーパ", "ニコ", "ピアズ", "オイゲン", "ウェスト",
	"ムゲン", "ユーゲン", "オオガミ", "イチロウ", "ヨネダ", "イッキ", "ユウイチ", "シシド", "コウセイ", "オカ", "ニコ", "ドッグ", "ワンワン", "ポンチ",
	"ウェイジ",
	
	"ウリン" //May Ci-ens
];

const ENEMY_NAMES_GOBLIN_SCH =  [
	"哥比", "哥布吉", "哥布蔵", "哥布利基", "哥布曼", "哥布尼", "哥布尔", "哥布洛克", "哥布丸", "哥布奇", "哥布斯", "哥布特",
	"哥布哥布", "哥布丁", "哥布夫", "哥布多", "哥布苏", "哥布松", "哥布伦", "哥布徳", "哥布郎", "哥布普", "高布", "哥布太", "哥布恩",
	"哥布米", "哥布克", "哥布亚", "哥布拉斯", "哥布德鲁", "哥布利克", "哥布瑞", "哥布美", "哥布隆", "哥布朗", "哥布利姆", "哥布利",
	"哥布肯", "哥布宾果", "哥布汉", "哥布平", "哥布雷", "哥布贝尔", "哥布拉", "哥布得尔", "哥布丁", "哥布罗姆", "哥布理斯", "哥布索",
	"哥布奇诺", "哥布布拉", "哥布旦那", "哥布帕索", "哥布诺", "哥布托德", "哥布利亚", "哥布各布", "哥布哈利", "哥布拜克", "哥布翰", "哥布莱达",

	"扎克·毕克", "葛雷林", "高布", "大小苞" //May Patreons
];

const ENEMY_NAMES_GOBLIN_TCH =  [
	"ゴビィ", "ゴブッコ", "ゴブロク", "ゴブワン", "ゴブイチ", "ゴブシ", "ゴブーブ", "ゴブナマ", "ゴブレム",
	"ゴブゴブ", "ゴブティン", "ゴブ夫", "ゴブドー", "ゴブツー", "ゴブデン", "ゴブップ", "ゴーブー", "ゴブユキ",
	"ゴブポン", "ゴブブゴ", "ゴブラ", "ゴブメン", "ゴブシ", "ゴブシチ", "ゴブドット", "ゴブイキ",
	"ゴブース", "ゴブミドリ", "ゴブイク", "ゴブンブル", "ゴブピー", "ゴブッス", "ゴブワズ", "ゴブナウ", "ゴブーカー", 

	"御米", //January Ci-ens
	"大根御" //August 2021 Ci-ens
];

const ENEMY_NAMES_NERD_SCH =  [
	"卡尔", "眼镜片", "凯尔克", "蒂米", "吉米", "数字寿司", "尼古尔", "蕾", "东克", "动词", "坎耶",
	"谢尔顿", "古拉迪欧斯", "克莱斯特", "思恩", "科隆克", "日富美", "玄智", "光藤", "埃尔汗", "螺旋",
	"亚历山大", "菲农", "泰勒", "诺尔", "卡普勒", "叉子", "迪布", "马尔文", "维拉布", "刘克",
	"雷因", //August Patreons

	"原子·伽里", "本·多酚", "约翰·戴维斯", "克里斯·科利皮", "尼克·麦克纳迪",
	"吉·维利", "卡尔·玛米德",
	
	"赔钱, 狷狂"
];

const ENEMY_NAMES_NERD_TCH =  [
	"キバ", "オブ", "ケン", "田中", "スエオ", "佐藤", "日野", "飯山", "三善", "鶴巻", "本田", "園田", 
	"富野", "パヤオ", "岡田", "トシオ", "コーヘー", "森", "タッキー", "モーレツ", "トラ", "ノアナ", "テツ", "スシオ", "モマイラ",
	"ハカー", "橋田", "イタル", "ネーヨ", "マンドクセ", "ニチャン", "ヌルポ", "プギャー", "カイヨー", "ホット",
	"ダイコン", "ガイナ", "カラー", "マサユキ", "ナード", "ギーグ", "ヒロシ", "トリガ", "ポンズ", "ダイキ", "ディオー",
	"サクラ", "ダブ", "ゴンゾウ", "ライデン", "マッパ", "エーワン", "ユーフォ", "ライジングサン", "シャフ", "ウィット", "アイジー", 
	"カドカワ", "ガンホウ", "メッグ", "ファンザ", "アトラス", "ファルコ", "バンナム", "ハル", "プラチナム", "マベラス", "レッド",
	"ミスト", "メヴィウス", "メトロ", "フリュ", "エニクス", "アイオウ",	"アカベー", "パルテノン", "エフシィ", "クロック", "アップ",
	"スタック", "メイビー", "ニトロ", "プラス", "オーガス", "ライアー", "レイル", "スカイ", "ルネ", "ゆず", "キテル", 
	"エヌエルス", "タマ", "トイハ", "テンガ", "ライド", "ギガ", "キイ", "ミンク", "メイト", "レンズ", "エイシス", "ハッピー", "ライフ",
	"アルター", "グッスマ", "アニプレ", "ホビジャ", "マックス", "アクアマ", "ファット", "ユニオン", "プラム", "ブロッコ",
	"ムーン", "バインディン", "マウス", "シックス", "チューブ", "フロッグ", "ネイティブ",

	"ヴァルデロス", "エリックス", "ナポレオン", "シブキ", //October 2021 Ci-ens
	"坂田" //November 2021 Ci-ens
];


const ENEMY_NAMES_ROGUE_SCH =  [
	"雷诺德", "低语", "卡威卡", "韦德", "伊特", "雅克", "简妮", "康纳",
	"肃静", "半藏", "杰克斯", "中村", "佑太", "维兰德", "丹佐", "威尔森",
	"隐匿", "摩立特", "蒙卡", "齐林", "皮耶罗", //October Patreons

	"鬼影", "贝克·斯塔贝斯", "格莱比", "清九郎", "肯尼",
	"大河优", "宾根·李", "强尼·奎克", "本·多酚", "鬼影" //October Patreons
	
];

const ENEMY_NAMES_ROGUE_TCH =  [
	"アルター", "コナー", "エド", "エツィ", "ジェイ", "フライ", "アウディ", "アルノ", "アドウェル", "シャオ", "ユン", "カムイ", "シャドウ",
	"タミール", "ガルニエ", "タラール", "ロベル", "マイルズ", "ワーレン", "ジョヴァン", "ペトル", "クラウ", "マリオ", "ラァ", "シノビ",
	"レオナルド", "アントニオ", "ニッコ", "マルコ", "クリス", "ベン", "ジェイムズ", "チャーリー", "スティド", "ウッズ", "朧丸", "カゲ",
	"レイナルド", "ウィスパー", "ウェイド", "ウィルソン", "ユッタ", "キリン", "モンカ", "ユウ", "グラビィ", "セイクロ", "ニンジャ", "バック",

	"バラバラさん", //May Ci-ens
	"月輝夜" //September 2021 Ci-ens
];

const ENEMY_NAMES_HOMELESS_SCH =  [
	"施陶布·厚德", "闪烁", "渣滓", "伽里", "臭仔", "阿洛伊修斯", "冉静", "富有",
	"布鲁斯", "罗杰德", "哈嚷", "博格斯", "鱼", "德米特里", "莫蒂默", "多诺万",
	"汉森", "松基耶", "布兰奇", "格雷格", "石匠", "泰隆", "鲍勃", "詹姆士",
	"内森", "吉巴达", "埃文德", "罗伯特", "穆斯塔法", "里克", "波邦迪", "康",
	"傻蛋", "吉米", "勇", "唐纳德", "大卫", "快步者", "路易斯", "奎克",
	"瓦苏里", "罗纳德", "渡鸦", "埃德敏", "埃尔伯特", "汉克", "韩", "格里高",
	"卡尔斯", "布克斯", "芒巴格", "米克斯", "邋遢", //November Subscribers

	"臭仔", "拉兹洛", "脏麦克", "奥斯卡", "罗航", "威廉", "臭臭泥", "哈利大屌",
	"莱斯特", "卡利斯", "杰克", "伽里", "比维斯", "讨厌的内特", "清洁工" //November Subscribers
];

const ENEMY_NAMES_HOMELESS_TCH =  [
	"ゴメ", "ギン", "ハナ", "ビン", "サト", "ヤマ", "コン", "アム", "ロイ", "キマ", "アス", "ダテ", "アノ", "ニカ", "チタ", "ダム", "キド", 
	"ナグ", "ツタ", "ネオ", "ヤジ", "ニモ", "レタ", "コト", "ナイ", "ノニ", "ブラ", "イト", "ノア", "マチ", "ルダ", "カイ", "シデ", "カト", 
	"アツ", "シマ", "アガ", "ソン", "ナオ", "トナ", "シユ", "セイ", "シテ", "ヤル", "ニゲ", "チヤ", "メダ", "ボリ", "バン", "テキ", "トウ", 
	"ドウ", "ジヨ", "ウス", "ナラ", "カネ", "オク", "イエ", "ナキ", "アダ", "チユ", "テニ", "イレ", "ロド", "ラゴ", "ボウ", "ゼト", "カメ", "セン", 
	"ニン", "クリ", "リン", "ヤム", "チヤ", "ピツ", "コロ", "ダイ", "マオ", "ピラ", "フサ", "フリ", "イザ", "ドド", "ザボ", "ベジ", "イタ"
];

const ENEMY_NAMES_LIZARDMAN_SCH =  [
	"伊奇", "波多", "斯凯", "博瑞格", "宁沃德", "弗兰瑞奇", "肯", "格拉",
	"扑抓", "布鲁福德", "雷佐诺", "路西斯", "加倍罗", "雷佐", "斯坦利", "斯内普",
	"斯凯尔", "下内客", "拉佛", "贾刹", "里克", "孜然", "扎奇", "卡波",
	"桑卡", "雷·萨德", "寇摩多", "扎克", "拐子", "尼克斯", "斯凯塔利斯", "丹",
	"克罗克", "扎德", "阿尔贡", "韦斯琳", "瓦卡兹", "莎莉", "乌尔格罗格", "佐贝克",
	"扎尔仏斯", "阿贝林", "阿尔安", "多兰", "内加", "沃克", "斯克斯", "冈瑟",
	"斯阔加尔", "胜月", "贺米平", "贺雷娜", "佩佩", "察卡斯", "兹科尔", "萨尔萨",
	"羊", "梅内德", "吉尔斯佐欧", //July Patreons

	"沛公", "滑滑子", "贾寇斯", "瑟喷多先生", "脊尾", "扎克扎克", "莎莎", "祈祷",
	"青梅里克俞", "鳄鱼 ", "蜥蜴人巫师", "塞科萨索尔", "埃德", "春·爱", "波伊兰特", "六羊",
	"波阿瑞克坦", "抬尾", "嘉拉", "卢克索", "杰弗蕾", "维特维尔", "霍拉提欧"
	//July Patreons
];

const ENEMY_NAMES_LIZARDMAN_TCH =  [
	"ザリュース", "クルーシュ", "トカーゲ", "スギータ", "ヤモーリ", "カナーヘビ", "イモーリ", "ラケール", 
	"ユーリン", "イグアーナ", "ヘービ", "ハチュール", "バイパー", "カメレーオ", "フトアーゴ", "サウルース", 
	"テユー", "キタテグー", "アルマージ", "アガーマ", "アルデーオ", "ゲッコー", "アカイーロ", "ドリーコ", "ババーリ",
	"ヒュドーラ", "ニッソー", "ニホーン", "ヒョウモーン", "レオパード", "カブート", "ツーノ", "オニプレート", "アオジータ",
	"ミミーズ", "マツカーサ", "モトーイ", "イーワ", "ガイアーナ", "ピーターズ", "バンデード", "ストケース",
	"アリゲータ", "アガーマ", "イグアーナ"
];

const ENEMY_NAMES_ORC_SCH =  [
	"杨", "格朗克", "米奇", "多语", "奎克", "奥兰多", "哈吉", "拉吉", "大块头", "比冰卡", "坠克",
	"斯朋里克", "泰坦", "思格沃德", "普多", "皮珀", "丹德里恩", "布拉托斯", "蒙尔克", "佛洛格", "布拉", "罗塔德",
	"博格", "丹特", "闯客", "斯克鲁卡", "狼群", "埃里克欧斯", "格罗戈纳客", "钢波", "格洛克", "马库罗斯", "雷",
	"卢柯蒂斯", "宏", "葛博", "米克哈尔", "珀革", "斯特罗绮", "米尔格", "多拉奎尔", "多纳德", "西格嘉德", "加博洛尼",
	"徕卡", "季默西", "卡哈利", "格尔洛尼", "蒙克尔克", "混合物", "纲佐", "马克森", "阿特拉斯", "城堡", "梁",
	"布雷马克", "戈尔贡格", "阿格尼米", "左格左格", "打击者", "阿尔滨", "亡灵", "杀马特", //June Patron

	"甜猪肉", "大块儿", "雷克多·埃洛科", "邦·图克", "斯努格·斯努格", "麦克斯马斯特", "大萝卜", "阔克阔伊", "葛洛纳", "羊", "本格尔",
	"威特沃尔", "大库康", "西瓜", "瘀伤余", "多纳尔", "欧尔悉尼", "本·哈特", "波尔波", "杰弗蕾", "宫木山", "六羊" //June Patron
];

const ENEMY_NAMES_ORC_TCH =  [
	"ブウ", "トンキチ", "ポーキー", "ポルコ", "ロッソ", "ピグレット", "ハム", "ザエモン", "ホーク", "ウーロン", "ベイブ", "ピギー", "グンター",
	"クロブー", "ピッグ", "ハッカイ", "プア", "ペッパ", "トントン", "トリート", "ハート", "バネブ", "ロース", "ネック", "タン", "スネ", "バラ",
	"モモ", "ヒレ", "カシラ", "テール", "ミミ", "ヨーク", "デュロック", "ランド", "ベイブ", "トントロ", "イベリコ", "トンテキ", "プルコギ",
	"カツ", "ドン", "ロシータ", "バムセ", "ブタメン", "エスコク", "リョウガ", "ピッポ", "ベーコン", "ケビン", "トンテキ", "クシ", "レーズン",
	"ブタマン", "ペッパ", "ジョージ", "ブーリン", "オークス", "マクベス", "ヤナギー", "クーキン", "スース", "スクローファ", "ドメス", "ティクス",
	"オニク", "ブースター", "キートン", "コットン", "トンボ", "ハミルトン", "ウェリントン", "ブービー", "ブーン", "ブータン", "プー太郎", "ぶーやん",
	"ムー", "ホッグ", "シュヴァイン", "コション", "ポルコ", "セルド", "ヒュース", "スヴェイヤー", "ヴァルクン", "プアア", "チュー", "ドエジ",
	"ヴァルケン", "ハンズィール", "グリース", "プラッセ", "スーアル", "ポルク", "ビフ", "レイタオ", "ハヌゥート",

	"ジュジオック" //November 2021 Ci-ens
];

const ENEMY_NAMES_WEREWOLF_SCH =  [
	"伊奇", "撕扯", "米特", "韦根", "卫轧斯", "凡里斯", "雅阁", "卢锡安", "巴那", "好男孩",

	"博迪", "伊登", "杰洛特", "汤米", "穆覃枸", "咕咕可", "达也", "桃子",
	"舒穆茨", "丹特", "杰瑞", "海辛", "阿诺多", "芬里尔", "拉普洛德",
	"智", "坊", "五线谱", "伯尼", "布鲁斯", "加斯帕德", "蓬松", "雷克斯", "丹", "里斯", "鲍勃",
	"寇蔻", "狗哥", "白狼", "棘手", "蕾", "鼻烟", "锡安", "克拉克", "杰夫", "冰冷",
	"亚瑟", "点", "月", "垒", "捶打", "巴雷克", "天狼星", "弘", "斯特雷格斯", "帕洛马尔",
	"刺", "健地", "朱诺", "波奇", "咆哮者", "诺克提斯", "尤亚", "佩尔森", "卡拉卡", "苏克拉",
	"呋喃山", "凯瑟尔", "啾啾", "分趾袜", "小丑", "方", "菲尼亚斯", "维尔", "博西", "马蒂亚斯", "摊位",
	//February SubStar

	"螺柱", "芬里尔", "人狼", "杰夫", "伊拉斯库斯", "羽扇豆三世", "菲多", "德克斯特", "毛茸茸的巴里",
	"联合航空", "阿尔菲", "狼群", "爪子", "哈利汉姆", "乌芬丁", "兔子杰基", "亚利桑那"
	//February SubStar
];

const ENEMY_NAMES_WEREWOLF_TCH =  [
	"ケヴィン", "カール", "ルガー", "ワンワン", "ドギー", "トウヤ", "ボン", "大神", "モロ", "ジンロー", "ガロン", "ハヤテマル", 
	"ポチ", "ハチ", "コロ", "ラッシー", "ロッキー", "パトラッシュ", "ギア", "ドッグ", "ディンゴ", "キバ", "ガルル", "コウガ",
	"ハティ", "マルコ", "オドネル", "アケーラ", "ラクシャ", "ボルフガング", "シベリア", "チーフ", "リカルド", "ホロ", "サダハル",
	"イギー", "チーズ", "スリンキー", "ニゴウ", "ヴィズ", "ナイツ", "ハイイロ", "ベルクマン", "ドーベル", "ツンドラ", "エゾ", "ダイア"
];

const ENEMY_NAMES_YETI_SCH =  [
	"反胃", "小小", "宝宝", "普里默斯", "坦克", "酯", "战争基金", "罗德", "贝蒂", "斯威提", "意面",
	"蓝", "白", "王",

	"杰克", "迪伦", "狄伦", "卢克", "多里安", "郡警", "基法", "里雷", "提姆", "沙利文",
	"阿诺多", "波波", "恩里科", "蓬松", "本博", "克朗克", "炕", "雅玛", "蒙克", "兰德尔",
	"杰特", "瓦萨", "愤怒", "库普", "博尔戈", "米洛洛", "雷德兹", "曼弗雷德", "雷纳托", "哈兰贝",
	"动物园", "班巴", "虎志", "格鲁多", "格克", "史蒂文", "惠罗吉", "绒毛", "幸运", "孔",
	"加戈斯", "查普", "猿", "洛瑞亚斯", "宝贝", "瑞德", "冰茶", "冰霜", "雷里", "盖",
	"跳跃", "石头", "努努", "托弗", "哈多", "奥兰", "宁次", "冰手", "王", "蜜蜂", "挖", //March SubStar

	"白毛", "毛圈", "三司寇", "毛球", "大扳手", "北佛", "凯米鲁",
	"杰拉尔德", "风格", "大脚", "佩利乌斯", "耶塔", "塞里努尔", "叶", "大玉米饼",
	"塔梅尔", "邦戈先生", "孔", "空", //March SubStar
	
	"三次郎"

];

const ENEMY_NAMES_YETI_TCH =  [
	"ブルー", "マイク", "スノーアイス", "ユッキー", "シロ", "サスカッチ", "ゴマ", "北極", "コング", "ゴリ", 
	"ドンキー", "ホンダ", "みくら", "カオル", "ツーディー", "マードック", "ラッセル", "ヌードル", "ハロルド", "ソラチ",
	"ジョージ", "ソン", "サイヤン", "ゴクー", "ゴハン", "ブロリィ", "ベジー太", "コンドー", "グロッド", "ジャイアン",
	"アカギ", "ゼラ", "ランページ", "オラ", "ウータン", "ドウェイン", "シャバーニ", "アイヴァン" 

];


const ENEMY_NAMES_SLIME_SCH =  [
	"滴", "啪嗒", "咕噜", "噗通", "斯灵", "湿吻", "漏斗", "骗子", "杰瑞",
	"弹弹", "爆裂", "橘子", "跷跷板", "滴滴", "杰里", "杰罗", "丰满", "气球",
	"碎片", "昨日", "敏思", "普利", "史莱米"

];

const ENEMY_NAMES_SLIME_TCH =  [
	"リムル", "ゴメ", "ぷよ", "ジェリー", "ビーン", "ベス", "マシュマロ", "バター", "ラメ", "ヨーグルト", "バブル", "マリン", 
	"ナイト", "タワー", "ボーグ", "ドラゴ", "ファング", "スラッピー", "スラリン", "ホイミン", "サスケ", "アキーラ", "スラリン",
	"餅", "ライムライム", "ドロドロ", "ヌルヌル", "ポリ", "ホウシャ", "デンプン", "シリコーン", "ウーベタベタ", "グラーチ", "ボンド",
	"ウーブレック", "グリッター", "エーエス", "エムアール"
];

const ENEMY_NAMES_VISITOR_MALE_SCH =  [
	"迭戈", "布莱恩", "多诺万", "麦克斯韦", "吉格利安", "杰克", "泰隆", "马克西米利安",
	"文森特", "金块", "阿修罗", "蒙德利尔", "克劳德", "克利福德", "比尼", "布利斯昆",
	"拉森", "鲁希塔", "格蕾丝", "特洛伊", "阿尔文", "卡尔", "唐纳德", "鲍勃",
	"恩赐", "罗兰", "杰登", "费利克斯", "克洛克", "麦克斯", "杨", "奥斯丁",
	"约翰尼", "贡纳", "安格斯", "赛斯",

	"格雷戈里", "仏耶普", "莱基姆", "菲拉亨", "诺特·伊韦尔", "候保三", //January Patrons


	"多芬", "米奇", "阿诺尔多", "阔尔达", "菲尔散", "萨谬", "埃尔丁", "德芙屌",
	"哈迪", "马特亚德", "哈利", "卡斯卡", "小黄", "斯考特", "泰萨肯", "迪诺",
	"泰勒", "乔尔", "达佐", "桑卡拉", "扎尔菲", "奥林",

	"所戴尔", "马克西慕斯", "查德", "大卫懒懒", "汉姆则", "雷贝迪", "杰" //January 2021 Patrons
];

const ENEMY_NAMES_VISITOR_MALE_TCH =  [
	"ゴメル", "ゴン", "モリベト", "アマロー", "セグ", "タケシ", "ロンジ", "ヒューゴ", "ハリー", "ヤマ", "ロジ", "リブ", "マーク", "トランプ", "ゴン",
	"スティーブ", "ジェフ", "ラリー", "アラッド", "マイケル", "ニック", "コリィ", "ゾディン", "ハマー", "ジュジン", "コウスケ", "ワユ", "シノム",
	"ジェイドン", "アンガス", "セス", "クロック", "ディエゴ", "ブライアン", "ドノバン", "マックス", "ジャック", "ビーンズ", "オースティン",
	"グレゴリオ", "ショーン", "リーキン", "フェルエン", "ノック", "ホボ", "ヤン", "ボブ", "ドナルド", "ギャビン", "トイ", "アンディ", "ウッディ",
	"ケンジ", "モトキ", "マサル", "シュウ", "クラウド", "ザック", "カール", "グレス", "バレン", "チェスター", "オース", "ウェイユ", "アトラン",
	"ヤマモト", "タナカ", "オッス", "オラ", "ソン", "ゴモラ", "ドラゴ", "バル", "ズィー", "チョウ", "アサダ", "チャン", "ジム", "ミッキー"
];

const ENEMY_NAMES_VISITOR_FEMALE_SCH =  [
	"凯利", "莉莉", "丽塔", "科丽娜", "那加那", "碧翠斯", "达芙妮", "索里亚",
	"艾里", "弗兰", "塞琳娜", "美", "洛卡", "丽莎娜", "基拉", "詹娜",
	"和风", "莉莉丝", "小维",

	"莎莉·史瓦兹", "萨那莉亚·奥伦戴尔", "真央爱", "萨斯基亚斯", //January 2020 Patrons


	"罗拉", "霎那", "爱贝欧拉", "悌", "芭优",

	"由美雷文", "瑟琳伊尔", "梅·格林" //January 2021 Patrons
];

const ENEMY_NAMES_VISITOR_FEMALE_TCH =  [
	"ケリィ", "リリー", "ミリア", "カリナ", "ノラミ", "ジェニファー", "メイ", "ソニア", "レイナ", "フラウ", "ミライ", "カテジナ", "シャン",
	"ノリコ", "クミコ", "アケミ", "ミナコ", "ガーネット", "エマ", "ハナコ", "マオ", "アイ", "キャシィ", "ベアトリス", "マリサ", "ユユコ", "レイム",
	"アンネ", "ピリミ", "ジャネット", "ミーシャ", "セレーナ", "ミランダ", "ピナ", "クラリス", "バービー", "ルイ", "エリカ", "マヤ", "カズミ", "ミク"	
];

const ENEMY_NAMES_VISITOR_UNISEX_SCH =  [
	"奎因", "德特金克", "希纳", "奎因", "博特",

	"格温·魏斯", //January 2020 Patrons

	"邦" //January 2021 Patrons
];

const ENEMY_NAMES_VISITOR_UNISEX_TCH =  [
	"シノブ", "リン", "ルカ", "ヒカル", "キュル", "ラミ", "ラーイ", "ジョピ", "コイン", "ネイセ", "ポー", "ローロ", "ルー"
];


//Prefix

//-15% all stats

const ENEMY_PREFIX_BAD_SCH =  ["毛骨悚然的", "脆弱的", "病弱的", "缓慢的", "短小的", "矮的", "肥胖的", "愚笨的", "瘦弱的", "无聊的", "弱小的", "虚弱的", "不受欢迎的", "变态的", "胆小的", "羞耻的", "贫穷的", "毫无价值的", "笨重的", "被吓坏的"];
const ENEMY_PREFIX_BAD_TCH =  ["ダサ", "不潔", "地味", "ヘボ", "バカ", "よぼよぼ", "弱い", "便秘", "寝不足", "弱過ぎ", "弱気な",  "残念", "病弱", "貧乏", "臭い", "ザコ"];

const ENEMY_PREFIX_DRUNK_SCH =  ["醉倒的", "醉酒的", "发酒疯的", "醉醺醺的", "苦瓜脸的", "喝醉的"];
const ENEMY_PREFIX_DRUNK_TCH =  ["ほろ酔い", "泥酔", "狂酔", "酔いどれ", "ドランク"];
//-15% all stats, -1 ejaculation stock

const ENEMY_PREFIX_HUNGRY_SCH =  ["饥饿的", "吃不饱饭的", "营养失调的"];
const ENEMY_PREFIX_HUNGRY_TCH =  ["腹ペコ", "ひもじい", "空腹"];
//-25% all stats, -1 ejaculation stock

const ENEMY_PREFIX_STARVING_SCH =  ["饥饿的", "脆弱的"];
const ENEMY_PREFIX_STARVING_TCH =  ["ガリガリ", "飢えた"];
//-25% Strength, -15% Stamina

const ENEMY_PREFIX_WEAK_SCH =  ["软弱的", "贫穷的", "衰弱的", "无力的", "矮小的", "运动不足的"];
const ENEMY_PREFIX_WEAK_TCH =  ["無力な", "貧弱", "もやし", "筋力なし", "丸腰", "運動不足"];
//-25% Dexterity, -10% Energy

const ENEMY_PREFIX_INEPT_SCH =  ["笨拙的", "无能的", "新人", "毫无技巧的", "体型矮小的", "短小的", "笨拙的", "经验不足的", "包茎的"];
const ENEMY_PREFIX_INEPT_TCH =  ["不器用", "下手くそ", "素人", "能無し", "ぶきっちょ", "稚拙", "薄のろ", "経験不足な", "短小", "包茎", "インポ"];
//-25% Agility

const ENEMY_PREFIX_SLOW_SCH =  ["缓慢的", "肥胖的", "昏昏欲睡的", "安逸的", "愚钝的", "笨重的", "迟钝的", "肥仔"];
const ENEMY_PREFIX_SLOW_TCH =  ["鈍くさ", "のろのろ", "のろま", "のんびり", "ゆっくり", "ニブチン", "居眠り", "スローな"];
//-25% Endurance, -10% Stamina, -15% Energy, -1 ejaculation stock

const ENEMY_PREFIX_SENSITIVE_SCH =  ["敏感的", "脆弱的", "性奋的", "早泄的", "勃起的", "猴急的", "快射了的", "很快的"];
const ENEMY_PREFIX_SENSITIVE_TCH =  ["根性なし", "種なし", "精なし", "耐性なし", "速イキ", "ビンカン", "早漏", "我慢弱い", "忍耐なし"];

//+15% All Stats, +25% Stamina, +15% Ejaculation Volume

const ENEMY_PREFIX_GOOD_SCH =  ["强壮的", "熟练的", "一流的", "健壮的", "优秀的", "帅气的", "有男人味的", "娘炮的", "有经验的", "大的", "饥渴的", "猛烈的", "不良的", "硬硬的", "热热的", "猛烈的", "刻薄的", "健壮的", "敏锐的", "多智的", "聪慧的"];
const ENEMY_PREFIX_GOOD_TCH =  ["強", "手練れ", "一流", "優秀", "熟練", "スーパー", "レスラー", "グレート", "イケてる", "大", "ゴリゴリ", "猛烈", "ちょいワル", "ごつい", "イカつい", "スマート", "凄い", "ガチ"];
//+30% All Stats, +35% Stamina, +50% Energy, +25% Ejaculation Volume, +1 ejaculation stock

const ENEMY_PREFIX_ELITE_SCH =  ["精英", "VIP", "邪恶的", "变态的", "无敌的", "皇家的", "超顽强的", "超一流的","主导的", "极恶的", "臭名昭著的", "全能的", "亢奋的", "惊人的", "富有魅力的", "最强的", "伟大的", "天才的"];
const ENEMY_PREFIX_ELITE_TCH =  ["エリート", "恐るべき", "チャンピオン", "無敗", "無敵", "極", "ベテラン", "超", "邪悪なる", "ロイヤル", "神", "悟りの", "ハイパー", "凄", "カリスマ", "最強", "偉大なる", "天才"];
//+30% Strength, +15% Stamina

const ENEMY_PREFIX_STRONG_SCH =  ["强壮的", "多智的", "有肌肉的", "健壮的", "肌肉发达的", "元气爆发的", "破坏者"];
const ENEMY_PREFIX_STRONG_TCH =  ["強靭な", "筋肉質な", "オラオラ", "マッスル", "マッチョ", "デストロイ", "破壊の", "元気爆発"];
//+30% Dexterity, +10% Energy

const ENEMY_PREFIX_DEXTEROUS_SCH =  ["灵巧的", "男优", "帅气的", "轻盈的", "技术好的", "麻利的", "上手的", "健壮的", "有经验的"];
const ENEMY_PREFIX_DEXTEROUS_TCH =  ["器用な", "ホスト", "イカせの", "男優", "技術系", "テクニシャン", "精力", "エナジー"];
//+30% Agility

const ENEMY_PREFIX_AGILE_SCH =  ["音速的", "高速的", "快捷的", "轻巧的", "忍者", "瞬发的", "极速的"];
const ENEMY_PREFIX_AGILE_TCH =  ["音速の", "高速", "忍者", "クイック", "スピード", "疾風の"];
//+30% Endurance, +35% Stamina, +25% Energy, +25% Ejaculation Volume, +1 ejaculation stock

const ENEMY_PREFIX_ENDURING_SCH =  ["忍耐的", "顽强的", "浓厚的", "猛男", "汁男", "大的", "健壮的", "欲望的", "经验丰富的"];
const ENEMY_PREFIX_ENDURING_TCH =  ["忍耐の", "我慢強い", "絶倫", "丈夫な", "頑丈", "汁男", "ぶっかけ", "ヤリチン", "欲望の", "経験豊富", "余裕の"];

//-25% Dexterity, -25% Endurance, +50% Energy
//With passives: -50% Charm, +50% Ejaculation Volume, +1 ejaculation stock

const ENEMY_PREFIX_VIRGIN_SCH =  ["童贞"];
const ENEMY_PREFIX_VIRGIN_TCH =  ["童貞"];

//+10% Strength, +10% Dexterity, +10% Agility, -50% Charm, Starts the battle with the Horny state

const ENEMY_PREFIX_HORNY_SCH =  ["饥渴的", "变态的", "性奋的", "淫秽的", "硬硬的", "性奋的", "淫秽的"];
const ENEMY_PREFIX_HORNY_TCH =  ["興奮", "変態", "おっ勃ち", "ハッスル", "勃起", "はぁはぁ", "興奮"];

//+25% Strength, +25% Dexterity, +25% Endurance, -25% Agility, +35% Stamina, +50% Energy, +50% Ejaculation Volume, +1 ejaculation stock

const ENEMY_PREFIX_BIG_SCH =  ["体格大的", "高耸的", "巨人", "强壮的", "挺拔的"];
const ENEMY_PREFIX_BIG_TCH =  ["デカマラ", "汁タンク", "ジャイアント", "ビッグ", "巨大", "デカ過ぎ", "どでか"];

//Starts the battle with the Angry state

const ENEMY_PREFIX_ANGRY_SCH =  ["愤怒的", "激怒的", "愤慨的", "沮丧的", "恼怒的", "激昂的", "发怒的"];
const ENEMY_PREFIX_ANGRY_TCH =  ["怒りの", "激怒", "アンガー", "ムカつき", "腹立ち", "激おこ", "激昂"];

//Metal

const ENEMY_PREFIX_METAL_SCH =  ["金属的"];
const ENEMY_PREFIX_METAL_TCH =  ["メタル"];

//+Talk lvl

const ENEMY_PREFIX_TALK_SCH =  ["饶舌的", "艺人", "话多的", "话痨", "猥琐的", "大声的"];
const ENEMY_PREFIX_TALK_TCH =  ["お喋り", "芸人", "話好き", "うるさい", "饒舌", "ダベり", "下ネタ", "猥談"];

//+Sight lvl

const ENEMY_PREFIX_SIGHT_SCH =  ["视奸的", "猥琐的", "变态的", "凝视者", "观察家", "目光如炬的", "目不转睛的"];
const ENEMY_PREFIX_SIGHT_TCH =  ["視姦", "のぞき", "ジロジロ", "見まくり", "凝視", "見てる", "ウォッチ", "観察"];

//+Maso lvl, +25% Stamina, +25% Energy

const ENEMY_PREFIX_MASO_SCH =  ["抖M", "豚化", "顺从的"];
const ENEMY_PREFIX_MASO_TCH =  ["ドＭ", "マゾ", "マゾ"];

//+Sado lvl, +10% Strength, +10% Dexterity, +10% Agility

const ENEMY_PREFIX_SADO_SCH =  ["抖S", "残忍的", "可怕的"];
const ENEMY_PREFIX_SADO_TCH =  ["ドＳ", "サド", "サド"];


const ENEMY_PREFIX_NEUTRAL_SCH =  ["普通", "凡人", "正常", "平均", "通常", "平凡", "一般", "庶民派", "早起", "无个性", "秃子", "光头", "臭烘烘的", "早睡", "无聊", "不突出的", "无精打采", "奇怪", "庶民"];
const ENEMY_PREFIX_NEUTRAL_TCH =  ["普通の", "凡人", "無個性", "ノーマル", "並", "モブ", "平均", "下っ端", "庶民派", "平凡", "月並み", "一般", "ただの", "量産型", "汎用", "にっこり", "早起き"];

